Autodesk.Revit.DB.Mechanical.MechanicalSystem.GetStaticPressure
Gets the static pressure of this mechanical system.
Remarks:
The system static pressure is calculated in the non-blocking evaluation framework. The caller may set up callbacks that react to the asynchronous calculation results.
If no callback is set up (e.g, called from third-party applications), the calculation is automatically switched to synchronous calculation so the caller
can access the up-to-date result. Similarly, the public method get_ParameterValue(BuiltInParameter.RBS_DUCT_STATIC_PRESSURE) has the same behavior. Due to this
change, the parameter RBS_DUCT_STATIC_PRESSURE no longer supports dynamic model update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The static pressure can not be calculated for this system.
Since:
2017

Autodesk.Revit.DB.Mechanical.MechanicalSystem.GetFlow
Gets the flow of this mechanical system.
Remarks:
The system flow is calculated in the non-blocking evaluation framework. The caller may set up callbacks that react to the asynchronous calculation results.
If no callback is set up (e.g, called from third-party applications), the calculation is automatically switched to synchronous calculation so the caller
can access the up-to-date result. Similarly, the public method get_ParameterValue(BuiltInParameter.RBS_DUCT_FLOW_PARAM) has the same behavior. Due to this
change, the parameter RBS_DUCT_FLOW_PARAM no longer supports dynamic model update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The flow can not be calculated for this system.
Since:
2017

Autodesk.Revit.DB.Mechanical.MechanicalSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a mechanical system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this mechanical system element's type.
name:
The name of the mechanical system to be created.
Returns:
The newly created mechanical system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid mechanical system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Mechanical.MechanicalSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a mechanical system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this mechanical system element's type.
Returns:
The newly created mechanical system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid mechanical system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Mechanical.MechanicalSystem.IsPressureDropServerMissing
Indicates if any pressure drop server which was used in the mechanical system is not available.
Returns:
True if there is any pressure drop server not available, false otherwise.
Since:
2014

Autodesk.Revit.DB.Mechanical.MechanicalSystem.IsWellConnected
Indicates if the system is well connected or not.
Remarks:
If the system is not well connected, parameters which need to be calculated are invalid.
Since:
2011

Autodesk.Revit.DB.Mechanical.MechanicalSystem.DuctNetwork
The ducts and fittings contained within the system.
Remarks:
The return value doesn't include terminals or equipments, the ducts and fittings are returned in no particular order.

Autodesk.Revit.DB.Mechanical.MechanicalSystem.BaseEquipmentConnector
The connector within the base equipment which is used to connect with the system.
Remarks: Assigning null to the base equipment connector will disconnect the base equipment from the system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when assigning a connector which is used in a system,
or when the connector's owner is not of type 'mechanical equipment'.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the set operation failed.
Remarks:  Setting this property will regenerate the document even in manual regeneration mode.

Autodesk.Revit.DB.Mechanical.MechanicalSystem.SystemType
The type of this duct system.

Autodesk.Revit.DB.Mechanical.MechanicalSystem
A mechanical system element.
Since:
2011